+++
title = "Kuzushiji MNIST"
categories = ["ai", "ml", "supervised"]
tags = ["classification", "multiclass", "cnn", "2-layer"]
toc = "true"
math = "true"
+++

This page is for finding a classifier on the KMNIST dataset. This dataset is more challenging than the original [[/projects/ml/supervised/mnist][MNIST]] dataset that I have previously solved.

The details of the dataset can be found in the associated [[https://arxiv.org/pdf/1812.01718][paper]].

In short, since the reformation of the Japanese education in 1868, there became a standardisation of the kanji characters, and in the present day, most Japanese people cannot read the texts from 150 years ago.

The dataset additionally contains 10 Hiragana characters with 7000 samples per class, we will begin our classification task by fitting increasingly sophisticated architectures to this simpler task.

#+begin_src jupyter-python :session kuzu :exports none
import matplotlib.pyplot as plt
from torchvision import datasets, transforms

# Define the transform (if not already defined)
transform = transforms.ToTensor()

# Load the dataset
trainset = datasets.KMNIST(root='./data', train=True, download=True, transform=transform)

# Dictionary to store one image for each label
label_images = {}

# Iterate through the dataset to find one image per label
for image, label in trainset:
    if label not in label_images:
        label_images[label] = image.squeeze()  # Remove channel dimension
    if len(label_images) == 10:  # Stop once we have one image for each label
        break

# Set grid dimensions (2 rows, 5 columns)
rows, cols = 2, 5

# Create a grid to display the images
fig, axs = plt.subplots(rows, cols, figsize=(12, 5))
axs = axs.flatten()  # Flatten the 2D array of axes to iterate easily

for idx in range(10):
    axs[idx].imshow(label_images[idx], cmap='gray')
    axs[idx].set_title(f'Label: {idx}')
    axs[idx].axis('off')  # Turn off axis for better visualization

# Adjust layout to fit everything nicely
* Imports
#+BEGIN_SRC jupyter-python :session kuzu
import torch
import torch.nn as nn
import torch.nn.functional as F
import torch.optim as optim
import sklearn.metrics as metrics
import numpy as np
from torchvision import datasets, transforms
#+END_SRC

#+RESULTS:
: /opt/anaconda3/envs/metal/lib/python3.11/site-packages/torchvision/io/image.py:14: UserWarning: Failed to load image Python extension: 'dlopen(/opt/anaconda3/envs/metal/lib/python3.11/site-packages/torchvision/image.so, 0x0006): Library not loaded: @rpath/libjpeg.9.dylib
:   Referenced from: <EB3FF92A-5EB1-3EE8-AF8B-5923C1265422> /opt/anaconda3/envs/metal/lib/python3.11/site-packages/torchvision/image.so
:   Reason: tried: '/opt/anaconda3/envs/metal/lib/python3.11/site-packages/torchvision/../../../libjpeg.9.dylib' (no such file), '/opt/anaconda3/envs/metal/lib/python3.11/site-packages/torchvision/../../../libjpeg.9.dylib' (no such file), '/opt/anaconda3/envs/metal/lib/python3.11/lib-dynload/../../libjpeg.9.dylib' (no such file), '/opt/anaconda3/envs/metal/bin/../lib/libjpeg.9.dylib' (no such file)'If you don't plan on using image functionality from `torchvision.io`, you can ignore this warning. Otherwise, there might be something wrong with your environment. Did you have `libjpeg` or `libpng` installed before building `torchvision` from source?
:   warn(

